#include <stdio.h>
//矩阵：本质就是二维数组
/*
  加法：两个矩阵必须维度相同（都是m×n）
  乘法：第一个矩阵的列数必须等于第二个矩阵的行数 
*/ 
main()
{
    int a[2][3]={1,2,3,4,5,6};
    int b[2][3]={1,2,3,4,5,6};
    int c[3][2]= {1,2,3,4,5,6};
    int d[2][3];
    int e[3][3]={0}; 
    //加法 
//    int i,j;
//    for(i=0;i<2;i++)
//      for(j=0;j<3;j++)
//        d[i][j]=a[i][j]+b[i][j];
//    
//    for(i=0;i<2;i++){
//    	for(j=0;j<3;j++)
//        	printf("%d ",d[i][j]);
//        printf("\n");
//	}
    //乘法 
    int i,j,k;
	for(i=0;i<2;i++){//第一个矩阵的行数 
		for(j=0;j<2;j++){//第二个矩阵的列数 
			for(k=0;k<3;k++)//第一个矩阵的列数 
			  e[i][j]+=a[i][k]*c[k][j]; 
		}
	} 
	
	for(i=0;i<2;i++){
    	for(j=0;j<2;j++)
        	printf("%d ",e[i][j]);
        printf("\n");
	}
    
}
